
import 'package:flutter/material.dart';
import 'package:path/path.dart';
import 'package:syncfusion_flutter_pdfviewer/pdfviewer.dart';
class RolesScreen extends StatelessWidget {
  const RolesScreen({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {

    return Scaffold(backgroundColor: Colors.white,
      // drawer: (Align()),
      appBar: (AppBar(backgroundColor: Colors.lightBlueAccent,)),
      body:Container(//height:200 ,width: 600,
        child:
        SfPdfViewer.asset('Image/low.pdf',),
      ),
    );
//     return Directionality(
//       textDirection: TextDirection.rtl,
//       child: Scaffold(
//         backgroundColor: Colors.grey[900],
//         appBar: AppBar(
//           backgroundColor: Colors.grey[700],
//           centerTitle: true,
//           title: const Text(
//             'Roles',
//             style: TextStyle(
//                 fontSize: 40, fontFamily: 'BebasNeue', color: Colors.black54),
//           ),
//           leading: IconButton(
//               iconSize: 30, onPressed: (){
//             Navigator.pop(context);
//           }, icon: const Icon(Icons.arrow_back)),
//         ),
//         body: SingleChildScrollView(
//           physics: const BouncingScrollPhysics(),
//           padding: EdgeInsets.all(20),
// child:
//
//     SfPdfViewer.asset('image/low.pdf',),
//           child: Text(
//             '''
//             يعود تاريخ الأكاديمية إلى عام 1954 حيث تم إنشاء معهد الإدارة العامة بناء على توصية من الخبير الإنجليزي "سنكر" والذي دعته الحكومة المصرية لدراسة كيفية النهوض بالإدارة المصرية المدنية، قد أوصى بإنشاء معهد الإدارة العامة لتولى إعداد وتدريب وصقل مهارات موظفي الحكومة،
//
// في عام 1961 تم تأميم وتمصير الشركات (منظمات الأعمال) العاملة في مصر مما استوجب الاستعانة بالكوادر المصرية لإدارتها، الأمر الذي استلزم إنشاء المعهد القومي للإدارة العليا لإعداد وتدريب كوادر ومستويات الإدارة العليا بهذه الشركات والمؤسسات العامة،في عام 1967 تم إنشاء معهد الإدارة المحلية لتدريب قيادات وكوادر الحكم المحلى، ومن هنا أضحى في مصر ثلاث معاهد حكومية تتولى كل في مجالها نشاط التنمية الإدارية، في عام 1970 استلزم الأمر - ومن واقع التجربة - ولتحقيق التكامل والتجانس والفعالية في تقديم الخدمة التدريبية دمج المعاهد الثلاثة في مؤسسة تدريبية واحدة هي المعهد القومي للتنمية الإدارية ليصبح المؤسسة الأولى من نوعها في العالم العربي، والذي أصبح مسئولا عن مجالات التنمية الإدارية في جمهورية مصر العربية، وليمتد نشاطه للمنطقة العربية بأسرها.
//
// وقد أوضحت التجربة مدى الارتباط اللصيق للعملية التعليمية بالنشاط التدريبي اللازم لخلق وتنمية الكوادر الإدارية، الأمر الذي أوجب ضرورة إضافة النشاط التعليمي الإداري المتميز كأساس لنشاط تدريبي متخصص، مما استلزم تطوير المعهد، ومن ثم تم إنشاء أكاديمية السادات للعلوم الإدارية.
// والتي أنشئت في مارس عام 1981 بمقتضى القرار الجمهوري رقم 172 لسنة 1981 باعتبارها هيئة علمية مستقلة تهدف إلى تنمية الإدارة في جميع المجالات على المستوى القومي....، والتي تركز على محاور التدريب والتعليم والاستشارات والبحوث والمعلومات، ثم صدر القرار الجمهوري رقم (30) لسنة 2004 بشأن إعادة تنظيم الأكاديمية .
//
// وتتكون الأكاديمية من :
// - كلية العلوم الادارية (القاهرة / بورسعيد / المنصورة/ الاسكندريه ) .
// والتي تمنح درجات البكالوريوس في العلوم الإدارية والدبلومات والمـاجستير والدكتوراه.
// وتشمل الأكاديمية أيضا عدة مراكز متخصصة، وهي :
// - مركز التدريب. - مركز البحوث والمعلومات.
// وتنتشر الأكاديمية جغرافيا في عدة مناطق، هي :
// - فرع الأكاديمية بمحافظة الإسكندرية .
// - فرع الأكاديمية بمحافظة بورسعيد (لخدمة مناطق القناة بمصر) .
// - فرع الأكاديمية بوسط الدلتا ويشتمل على فرعين بكل من مدينة طنطا بمحافظة الغربية ومدينة دكرنس بمحافظة الدقهلية .
// - فرع الأكاديمية بمحافظة أسيوط (لخدمة مناطق جنوب الوادي في مصر) .
// - فرع الأكاديمية بمحافظة المنيا .
// وكل فرع يمارس كافة أنشطة الأكاديمية من تدريب وتعليم واستشارات وبحوث ومعلومات كل في نطاقه الجغرافي.
// ويقوم على نشاط الأكاديمية الرئيسي (تدريب - تعليم - استشارات - بحوث ومعلومات) ما يربو على مائتين من أعضاء هيئة التدريس الدائمين حاملي درجة الدكتوراه في مجالات الإدارة المختلفة ، ويعاونهم ما يقرب من ثلاثمائة من الهيئة المعاونة لهيئة التدريس من المدرسين المساعدين (حاملي درجة المـاجستير) والمعيدين (حاملي درجة البكالوريوس) .
// هذا بخلاف الأمانة العامة (الشئون المـالية، الشئون الإدارية، الشئون الفنية)، التي يزيد عدد العاملين الدائمين بها عن أربعمائة.
// هذا بخلاف أن الأكاديمية تستعين في برامجها بخبراء غير دائمين ومتميزين من كافة التخصصات من هيئات التدريس بالجامعات والأكاديميات المصرية ومن خبراء المنظمات الحكومية ومنظمات الأعمال ذات التميز في الأداء.
// ويأتي التدريب تدعيمًا لدور الأكاديمية ومحورًا رئيسيًا لنشاطها من خلال مركز التدريب الذي أنشأ مواكبًا لتاريخ إنشاء هذه المنظمة العريقة.
//             '''.trim(),style: TextStyle(
//               fontSize: 18,
//               fontFamily: 'BebasNeue',
//               fontWeight: FontWeight.w500,
//               color: Colors.white),
//
//         ),
//       ),
//     );
  }
}
